###############################################################################
# Created by write_sdc
###############################################################################
current_design compute_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {activation[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {activation[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {activation[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {activation[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {activation[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {activation[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {activation[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {activation[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {en}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {valid_in}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {weight[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {weight[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {weight[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {weight[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {weight[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {weight[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {weight[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {weight[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc_out[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {valid_out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {valid_out}]
set_load -pin_load 0.0334 [get_ports {acc_out[31]}]
set_load -pin_load 0.0334 [get_ports {acc_out[30]}]
set_load -pin_load 0.0334 [get_ports {acc_out[29]}]
set_load -pin_load 0.0334 [get_ports {acc_out[28]}]
set_load -pin_load 0.0334 [get_ports {acc_out[27]}]
set_load -pin_load 0.0334 [get_ports {acc_out[26]}]
set_load -pin_load 0.0334 [get_ports {acc_out[25]}]
set_load -pin_load 0.0334 [get_ports {acc_out[24]}]
set_load -pin_load 0.0334 [get_ports {acc_out[23]}]
set_load -pin_load 0.0334 [get_ports {acc_out[22]}]
set_load -pin_load 0.0334 [get_ports {acc_out[21]}]
set_load -pin_load 0.0334 [get_ports {acc_out[20]}]
set_load -pin_load 0.0334 [get_ports {acc_out[19]}]
set_load -pin_load 0.0334 [get_ports {acc_out[18]}]
set_load -pin_load 0.0334 [get_ports {acc_out[17]}]
set_load -pin_load 0.0334 [get_ports {acc_out[16]}]
set_load -pin_load 0.0334 [get_ports {acc_out[15]}]
set_load -pin_load 0.0334 [get_ports {acc_out[14]}]
set_load -pin_load 0.0334 [get_ports {acc_out[13]}]
set_load -pin_load 0.0334 [get_ports {acc_out[12]}]
set_load -pin_load 0.0334 [get_ports {acc_out[11]}]
set_load -pin_load 0.0334 [get_ports {acc_out[10]}]
set_load -pin_load 0.0334 [get_ports {acc_out[9]}]
set_load -pin_load 0.0334 [get_ports {acc_out[8]}]
set_load -pin_load 0.0334 [get_ports {acc_out[7]}]
set_load -pin_load 0.0334 [get_ports {acc_out[6]}]
set_load -pin_load 0.0334 [get_ports {acc_out[5]}]
set_load -pin_load 0.0334 [get_ports {acc_out[4]}]
set_load -pin_load 0.0334 [get_ports {acc_out[3]}]
set_load -pin_load 0.0334 [get_ports {acc_out[2]}]
set_load -pin_load 0.0334 [get_ports {acc_out[1]}]
set_load -pin_load 0.0334 [get_ports {acc_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {valid_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {activation[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {activation[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {activation[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {activation[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {activation[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {activation[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {activation[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {activation[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {weight[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {weight[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {weight[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {weight[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {weight[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {weight[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {weight[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {weight[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
